#### BuiltInFailures.RenderFailures Members

---

|  |
| --- |
| BuiltInFailures RenderFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures RenderFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | LightParametersNotInRange | The value should be in range of [Value] and [Value]. |
| Public property Static member | LightSourceInsideGeometry | Light source is inside solid geometry. No light will be emitted during rendering. |
| Public property Static member | ProhibitDeletionLightSource | The light source cannot be deleted with UI. |
| Public property Static member | RenderLibNotInstalledWarn | Rendering library has not been installed, so the third party geometry cannot be created. |

# See Also

BuiltInFailures RenderFailures Class

Autodesk.Revit.DB Namespace